In [1]:
import pandas as pd
import numpy as np

C:\Users\lawrem1\Anaconda3\lib\site-packages\setuptools\distutils_patch.py:25: UserWarning: Distutils was imported before Setuptools. This usage is discouraged and may exhibit undesirable behaviors or errors. Please use Setuptools' objects directly or at least import Setuptools first.
  warnings.warn(

# Diclosure control warm up excercises for apprentices

Based on the learning hub course Awarness of Atatistical Disclosure Control with content taken directly from it. 

A few notes before we get started so you dont have to keep switching betwen the course and here. 

**The General Data Protection Regulation [GDPR]** mandates protection for personal data from which the identities of individuals can be determined from the data itself and other sources held by the data controller.  It refers to "special categories" of data, for which additional care must be taken.  These include:

* ethnic origin
* political affiliation
* religion
* biometrics (for ID purposes)
* health
* sexual orientation

An intruder can be:  

* an acquaintance using information gained by **knowing the respondent**, or
* a stranger using information in the **public domain**.

## The Three Major Data Formats

Disclosure control can be applied to any of the following data structures:

* microdata
* frequency tables
* magnitude tables

Statistical information is often held in the form of microdata after collection. In microdata each row corresponds to a single respondent: a business, individual or other statistical unit.

Because microdata are often highly disclosive, they are generally aggregated into frequency tables or magnitude tables before release.

The remainder of the course will outline the risks that each of these data formats pose, and the associated disclosure methods that can be used to reduce the risk to an acceptable level.

##### In this notebook we will only cover microdata

### Protecting Microdata

There are a number of techniques used to protect microdata. The primary method is restricting access under certain license agreements, which will be covered later. Others include:

* Removing identifiers
* Perturbation (such as adding noise)
* Recoding
* Top Coding

#### Excercise 1.1 remove the identifiers from the excercise 1 dataset 

Difficulty: Easy

In [2]:
ex1 = pd.read_csv('data/ex01.csv', index_col = 0) # plz don't chnage this cell!!

In [3]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [4]:
ex1_1 = ex1 # change this cell to include your solution

In [5]:
ex1_1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

#### Excercise 1.2 perturb the dataset acording to how unique the combination of values might be e.g. widows under 25 

Difficulty: Hard

In [6]:
ex1_2 = ex1 # change this cell to include your solution

In [7]:
ex1_2

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

#### Excercise 1.3 recode the dataset to change the marital status column 

Difficulty: Medium  

Hint: use a dictionary & map

In [8]:
ex1_3 = ex1 # change this cell to include your solution

In [9]:
ex1_3

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

#### Excercise 1.4 top or bottom coding

Difficulty: hmm... it kind of has levels
    
hint: Whats the rule for implimenting a chnage? whats the chang that is implimented?

In [10]:
ex1_4 = ex1 # change this cell to include your solution

In [11]:
ex1_4

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN